import math
#  Begin 1

a = 10
P = a * 4
print("Периметр квадрата равен", P)


#  Begin 2

a = 5
S = a ** 2 
Salt = a * a  # альтернативный способ
print("Площадь квадрата равна", S)
print("Площадь квадрата равна (альтернативный способ)", Salt)


#  Begin 3

a = 6
b = 4
P = 2 * (a + b)
S = a * b
print("Площадь прямоугольника равна", S)
print("Периметр прямоугольника равен", P)


#  Begin 4

d = 4
l = 3.14 * d
lalt = math.pi * d
print("Длина окружности равна", l)
print("Длина окружности равна (альтернативный способ)", lalt)


#  Begin 5

a = 3
v = a ** 3
S = 6 * (a ** 2)
print("Объем куба равен", v)
print("Площадь поверхности куба равна", S)


#  Begin 6
a = 2
b = 3
c = 4

v = a * b * c
S = 2 * (a * b + a * c + b * c)
print("Объем прямоугольного параллелепипеда равен", v)
print("Площадь поверхности прямоугольного параллелепипеда равна", S)


#  Begin 7

r = 5

l = 2 * 3,14 * r
lalt = 2 * math.pi * r
s = 3,14 * (r ** 2)
salt = math.pi * (r ** 2)
print("Длина окружности равна", l)
print("Длина окружности равна (альтернативный способ)", lalt)
print("Площадь круга равна", s)
print("Площадь круга равна (альтернативный способ)", salt)


#  Begin 8


