import math
#  Begin 1

a = 10
P = a * 4
print("Периметр квадрата равен", P)
print("Второй способ расчета прям в функции print:", "Периметр квадрата равен", a * 4)


#  Begin 2

a = 5
S = a ** 2 
Salt = a * a  # альтернативный способ
Salt2 = pow(a, 2)  # еще один альтернативный способ, pow - возведение в степень
print("Площадь квадрата равна", S)
print("Площадь квадрата равна (альтернативный способ)", Salt)
print("Площадь квадрата равна (альтернативный способ 2)", Salt2)


#  Begin 3

a = 6
b = 4
P = 2 * (a + b)
S = a * b
print("Площадь прямоугольника равна", S)
print("Периметр прямоугольника равен", P)


#  Begin 4

d = 4
l = 3.14 * d
lalt = math.pi * d
print("Длина окружности равна", l)
print("Длина окружности равна (альтернативный способ)", lalt)


#  Begin 5

a = 3
v = a ** 3
S = 6 * (a ** 2)
print("Объем куба равен", v)
print("Площадь поверхности куба равна", S)


#  Begin 6
a = 2
b = 3
c = 4

v = a * b * c
S = 2 * (a * b + a * c + b * c)
print("Объем прямоугольного параллелепипеда равен", v)
print("Площадь поверхности прямоугольного параллелепипеда равна", S)


#  Begin 7

r = 5

l = 2 * 3,14 * r
lalt = 2 * math.pi * r
s = 3,14 * (r ** 2)
salt = math.pi * (r ** 2)
print("Длина окружности равна", l)
print("Длина окружности равна (альтернативный способ)", lalt)
print("Площадь круга равна", s)
print("Площадь круга равна (альтернативный способ)", salt)


#  Begin 8


a = 4 
b = 3
avg = (a + b) / 2
print("Среднее арифметическое равно", avg)


#  Begin 9

a = 5
b = 10

geom_avg = math.sqrt(a * b)  # sqrt - квадратный корень
geom_avg_alt = (a * b) ** 0.5
print("Среднее геометрическое равно", geom_avg)
print("Среднее геометрическое равно (альтернативный способ)", geom_avg_alt)


#  Begin 10

a = 7
b = 2

sum = a + b
diff = a - b
prod = a * b
quot = a ** 2 / b ** 2
print("Сумма равна", sum)
print("Разность равна", diff)
print("Произведение равно", prod)
print("Частное квадратов равно", quot)


#  Begin 11

a = -8
b = 2

sum = a + b
diff = a - b
quot = abs(a) / abs(b)
print("Сумма равна", sum)
print("Разность равна", diff)
print("Частное модулей равно", quot)


#  Begin 12

a = 3
b = 4

c = math.sqrt(pow(a, 2) + pow(b, 2))
p = a + b + c
print("Гипотенуза равна", c)
print("Периметр равен", p)


#  Begin 13

r1 = 5
r2 = 3

s1 = math.pi * pow(r1, 2)
s2 = math.pi * pow(r2, 2)

s3 = s1 - s2
print("Площадь большего круга равна", s1)
print("Площадь меньшего круга равна", s2)
print("Площадь кольца равна", s3)


